In [1]:
import pandas as pd

In [2]:
data1={ "Name": ["Braund, Mr. Owen Harris","Allen, Mr. William Henry","Bonnell, Miss. Elizabeth"],
 "Age": [22, 35, 58],
 "Gender": ["male", "male", "female"]
}

In [4]:
df = pd.DataFrame(data = data1)
df

                       Name  Age  Gender
0   Braund, Mr. Owen Harris   22    male
1  Allen, Mr. William Henry   35    male
2  Bonnell, Miss. Elizabeth   58  female

In [9]:
df.Age.max()

58

In [10]:
df.describe()

             Age
count   3.000000
mean   38.333333
std    18.230012
min    22.000000
25%    28.500000
50%    35.000000
75%    46.500000
max    58.000000

In [12]:
country = ["Brazil", "Russia", "India", "China", "South Africa"]
capital = ["Brasilia", "Moscow", "New Delhi", "Beijing", "Pretoria"]
area = [8.516, 17.10, 3.286, 9.67, 2.98]
population = [200.4, 143.5, 1252, 133, 4.3]

In [13]:
brics=pd.DataFrame(data={'country': country, 
                  'capital': capital,
                  'area': area,
                  'population': population})

In [14]:
brics

        country    capital    area  population
0        Brazil   Brasilia   8.516       200.4
1        Russia     Moscow  17.100       143.5
2         India  New Delhi   3.286      1252.0
3         China    Beijing   9.670       133.0
4  South Africa   Pretoria   2.980         4.3

In [15]:
brics.shape

(5, 4)

In [16]:
brics.index

RangeIndex(start=0, stop=5, step=1)

In [19]:
brics.index = ['a','b','c','d','e']
brics

        country    capital    area  population
a        Brazil   Brasilia   8.516       200.4
b        Russia     Moscow  17.100       143.5
c         India  New Delhi   3.286      1252.0
d         China    Beijing   9.670       133.0
e  South Africa   Pretoria   2.980         4.3

In [21]:
brics.index =range(1,10,2)
brics

        country    capital    area  population
1        Brazil   Brasilia   8.516       200.4
3        Russia     Moscow  17.100       143.5
5         India  New Delhi   3.286      1252.0
7         China    Beijing   9.670       133.0
9  South Africa   Pretoria   2.980         4.3

In [24]:
type(brics['country'])

pandas.core.series.Series

In [27]:
type(brics[['country']])

pandas.core.frame.DataFrame

In [33]:
brics.population.dtype

dtype('float64')

In [36]:
brics = brics.set_index('country')

In [37]:
brics

                capital    area  population
country
Brazil         Brasilia   8.516       200.4
Russia           Moscow  17.100       143.5
India         New Delhi   3.286      1252.0
China           Beijing   9.670       133.0
South Africa   Pretoria   2.980         4.3

In [40]:
brics.reset_index()

        country    capital    area  population
0        Brazil   Brasilia   8.516       200.4
1        Russia     Moscow  17.100       143.5
2         India  New Delhi   3.286      1252.0
3         China    Beijing   9.670       133.0
4  South Africa   Pretoria   2.980         4.3

In [41]:
brics

                capital    area  population
country
Brazil         Brasilia   8.516       200.4
Russia           Moscow  17.100       143.5
India         New Delhi   3.286      1252.0
China           Beijing   9.670       133.0
South Africa   Pretoria   2.980         4.3

In [65]:
brics.reset_index(inplace=True )

In [66]:
brics

     capital       country    area  population
0   Brasilia        Brazil   8.516       200.4
1     Moscow        Russia  17.100       143.5
2  New Delhi         India   3.286      1252.0
3    Beijing         China   9.670       133.0
4   Pretoria  South Africa   2.980         4.3

In [68]:
brics

     capital       country    area  population
0   Brasilia        Brazil   8.516       200.4
1     Moscow        Russia  17.100       143.5
2  New Delhi         India   3.286      1252.0
3    Beijing         China   9.670       133.0
4   Pretoria  South Africa   2.980         4.3

In [72]:
type(brics)

pandas.core.frame.DataFrame

In [75]:
brics.index

RangeIndex(start=0, stop=5, step=1)

   level_0  index    capital       country    area  population
1        0      1   Brasilia        Brazil   8.516       200.4
2        1      2     Moscow        Russia  17.100       143.5
3        2      3  New Delhi         India   3.286      1252.0
4        3      4    Beijing         China   9.670       133.0
5        4      5   Pretoria  South Africa   2.980         4.3

In [83]:
# Sample DataFrame
import pandas as pd

data = {
    'country': ['Brazil', 'Russia', 'India', 'China', 'South Africa'],
    'capital': ['Brasilia', 'Moscow', 'New Delhi', 'Beijing', 'Pretoria'],
    'area': [8.516, 17.10, 3.286, 9.597, 1.221],
    'population': [200.4, 143.5, 1252, 1357, 52.98]
}

brics = pd.DataFrame(data)

# Setting index to the "capital" column
brics.set_index("capital", inplace=True)

# Now "capital" column becomes the index
print(brics)

                country    area  population
capital
Brasilia         Brazil   8.516      200.40
Moscow           Russia  17.100      143.50
New Delhi         India   3.286     1252.00
Beijing           China   9.597     1357.00
Pretoria   South Africa   1.221       52.98

In [84]:
brics

                country    area  population
capital
Brasilia         Brazil   8.516      200.40
Moscow           Russia  17.100      143.50
New Delhi         India   3.286     1252.00
Beijing           China   9.597     1357.00
Pretoria   South Africa   1.221       52.98

In [87]:
brics.reset_index(inplace = True)

In [88]:
brics

     capital       country    area  population
0   Brasilia        Brazil   8.516      200.40
1     Moscow        Russia  17.100      143.50
2  New Delhi         India   3.286     1252.00
3    Beijing         China   9.597     1357.00
4   Pretoria  South Africa   1.221       52.98

In [91]:
brics.set_index('capital', inplace = True)

In [92]:
brics

                country    area  population
capital
Brasilia         Brazil   8.516      200.40
Moscow           Russia  17.100      143.50
New Delhi         India   3.286     1252.00
Beijing           China   9.597     1357.00
Pretoria   South Africa   1.221       52.98

In [94]:
brics.reset_index(inplace = True)
brics

   index    capital       country    area  population
0      0   Brasilia        Brazil   8.516      200.40
1      1     Moscow        Russia  17.100      143.50
2      2  New Delhi         India   3.286     1252.00
3      3    Beijing         China   9.597     1357.00
4      4   Pretoria  South Africa   1.221       52.98

In [98]:
brics

   index    capital       country    area  population
0      0   Brasilia        Brazil   8.516      200.40
1      1     Moscow        Russia  17.100      143.50
2      2  New Delhi         India   3.286     1252.00
3      3    Beijing         China   9.597     1357.00
4      4   Pretoria  South Africa   1.221       52.98

In [156]:
# Sample DataFrame
import pandas as pd

data = {
    'country': ['Brazil', 'Russia', 'India', 'China', 'South Africa'],
    'capital': ['Brasilia', 'Moscow', 'New Delhi', 'Beijing', 'Pretoria'],
    'area': [8.516, 17.10, 3.286, 9.597, 1.221],
    'population': [200.4, 143.5, 1252, 1357, 52.98]
}

brics = pd.DataFrame(data)

In [143]:
brics

        country    capital    area  population
0        Brazil   Brasilia   8.516      200.40
1        Russia     Moscow  17.100      143.50
2         India  New Delhi   3.286     1252.00
3         China    Beijing   9.597     1357.00
4  South Africa   Pretoria   1.221       52.98

In [129]:
brics.columns

Index(['country', 'capital', 'area', 'population'], dtype='object')

In [130]:
brics.index

RangeIndex(start=0, stop=5, step=1)

In [131]:
type(brics.index)

pandas.core.indexes.range.RangeIndex

In [157]:
b=brics.rename(columns = {'country' : 'count','area':'ar'})
b

          count    capital      ar  population
0        Brazil   Brasilia   8.516      200.40
1        Russia     Moscow  17.100      143.50
2         India  New Delhi   3.286     1252.00
3         China    Beijing   9.597     1357.00
4  South Africa   Pretoria   1.221       52.98

In [158]:
a=b.rename(index={2: "India", 4: "SA"})

a

              count    capital      ar  population
0            Brazil   Brasilia   8.516      200.40
1            Russia     Moscow  17.100      143.50
India         India  New Delhi   3.286     1252.00
3             China    Beijing   9.597     1357.00
SA     South Africa   Pretoria   1.221       52.98

In [159]:
b.reset_index(inplace=True)

In [160]:
b

   index         count    capital      ar  population
0      0        Brazil   Brasilia   8.516      200.40
1      1        Russia     Moscow  17.100      143.50
2      2         India  New Delhi   3.286     1252.00
3      3         China    Beijing   9.597     1357.00
4      4  South Africa   Pretoria   1.221       52.98

In [167]:
b.drop(labels = ['index'] , axis = 1 , inplace =True)

KeyError: "['index'] not found in axis"

In [171]:
b

                capital      ar  population
count
Brazil         Brasilia   8.516      200.40
Russia           Moscow  17.100      143.50
India         New Delhi   3.286     1252.00
China           Beijing   9.597     1357.00
South Africa   Pretoria   1.221       52.98

In [172]:
b.reset_index(inplace = True)

In [173]:
b

          count    capital      ar  population
0        Brazil   Brasilia   8.516      200.40
1        Russia     Moscow  17.100      143.50
2         India  New Delhi   3.286     1252.00
3         China    Beijing   9.597     1357.00
4  South Africa   Pretoria   1.221       52.98

In [175]:
pd.__version__

'2.0.3'

In [179]:
b.ar.value_counts().sum()

5

In [182]:
b.ar.nunique()

5

In [185]:
# create a sample dataset
df = pd.DataFrame({
    'gender': ['male', 'male', 'female', 'female', 'male', 'female', 'male', 'female'],
    'education_level': ['high school', 'college', 'college', 'graduate', 'high school', 'graduate', 'college', 'graduate'],
    'score': [75, 82, 88, 95, 69, 92, 78, 85]
})

# create a crosstab table of gender and education level
df

   gender education_level  score
0    male     high school     75
1    male         college     82
2  female         college     88
3  female        graduate     95
4    male     high school     69
5  female        graduate     92
6    male         college     78
7  female        graduate     85

In [186]:
pd.crosstab(df.gender,df.education_level)

education_level  college  graduate  high school
gender
female                 1         3            0
male                   2         0            2

In [187]:
pd.crosstab(df.score,df.gender)

gender  female  male
score
69           0     1
75           0     1
78           0     1
82           0     1
85           1     0
88           1     0
92           1     0
95           1     0

In [191]:
# create a crosstab table of gender and education level with mean score
ct_mean = pd.crosstab(df['gender'], df['education_level'], 
                    values=df['score'], aggfunc='mean')
print(ct_mean)

education_level  college   graduate  high school
gender
female              88.0  90.666667          NaN
male                80.0        NaN         72.0

In [192]:
data={"name":["Bill","Tom","Tim","John","Alex","Vanessa","Kate"],      
      "score":[90,80,85,75,95,60,65],      
      "sport":["Wrestling","Football","Skiing","Swimming","Tennis",
               "Karete","Surfing"],      
      "gender":["M","M","M","M","F","F","F"]}

In [194]:
df=pd.DataFrame(data,columns=["name", "sport", "gender", "score", "age"],
                index=["one","two","three","four","five","six","seven"])
df

          name      sport gender  score  age
one       Bill  Wrestling      M     90  NaN
two        Tom   Football      M     80  NaN
three      Tim     Skiing      M     85  NaN
four      John   Swimming      M     75  NaN
five      Alex     Tennis      F     95  NaN
six    Vanessa     Karete      F     60  NaN
seven     Kate    Surfing      F     65  NaN

In [207]:
df.loc['one':'five']

       name      sport gender  score  age
one    Bill  Wrestling      M     90  NaN
two     Tom   Football      M     80  NaN
three   Tim     Skiing      M     85  NaN
four   John   Swimming      M     75  NaN
five   Alex     Tennis      F     95  NaN

In [210]:

df.loc[['one','two'],['name','age']]

     name  age
one  Bill  NaN
two   Tom  NaN

In [213]:
df.loc[:,['name']]

          name
one       Bill
two        Tom
three      Tim
four      John
five      Alex
six    Vanessa
seven     Kate

In [214]:
df.loc[['one','two','three'],['name','sport']]

       name      sport
one    Bill  Wrestling
two     Tom   Football
three   Tim     Skiing

In [215]:
df["age"]=18

In [216]:
df=pd.DataFrame(data,columns=["name", "sport", "gender", "score", "age"], 
                index=["one","two","three","four","five","six","seven"])
values=[18,19,20,18,17,17,18]
df["age"]=values
df

          name      sport gender  score  age
one       Bill  Wrestling      M     90   18
two        Tom   Football      M     80   19
three      Tim     Skiing      M     85   20
four      John   Swimming      M     75   18
five      Alex     Tennis      F     95   17
six    Vanessa     Karete      F     60   17
seven     Kate    Surfing      F     65   18

In [220]:
df['age']=18

In [218]:
df["pass"]=df.score>=70
df

          name      sport gender  score  age   pass
one       Bill  Wrestling      M     90   18   True
two        Tom   Football      M     80   18   True
three      Tim     Skiing      M     85   18   True
four      John   Swimming      M     75   18   True
five      Alex     Tennis      F     95   18   True
six    Vanessa     Karete      F     60   18  False
seven     Kate    Surfing      F     65   18  False

In [221]:
del df["pass"]
df

          name      sport gender  score  age
one       Bill  Wrestling      M     90   18
two        Tom   Football      M     80   18
three      Tim     Skiing      M     85   18
four      John   Swimming      M     75   18
five      Alex     Tennis      F     95   18
six    Vanessa     Karete      F     60   18
seven     Kate    Surfing      F     65   18

In [223]:
scores={"Math":{"A":85,"B":90,"C":95}, "Physics":{"A":90,"B":80,"C":75}}

In [224]:
scores_df=pd.DataFrame(scores)
scores_df

   Math  Physics
A    85       90
B    90       80
C    95       75

In [225]:
scores_df.T

          A   B   C
Math     85  90  95
Physics  90  80  75

In [228]:
scores_df.index.name="name"
scores_df.columns.name="lesson"

In [229]:
import numpy as np
data=pd.DataFrame(
    np.arange(16).reshape(4,4),
    index=["London","Paris",
           "Berlin","Istanbul"],
    columns=["one","two","three","four"])
data

          one  two  three  four
London      0    1      2     3
Paris       4    5      6     7
Berlin      8    9     10    11
Istanbul   12   13     14    15

In [231]:
np.arange(16).reshape(4,4)

array([[ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11],
       [12, 13, 14, 15]])

In [232]:
data['two']

London       1
Paris        5
Berlin       9
Istanbul    13
Name: two, dtype: int32

In [233]:
data[:3]

        one  two  three  four
London    0    1      2     3
Paris     4    5      6     7
Berlin    8    9     10    11

In [234]:
data[:4]

          one  two  three  four
London      0    1      2     3
Paris       4    5      6     7
Berlin      8    9     10    11
Istanbul   12   13     14    15

In [235]:
data[data['four']>5]

          one  two  three  four
Paris       4    5      6     7
Berlin      8    9     10    11
Istanbul   12   13     14    15

In [239]:
data[data<5] =0
data

          one  two  three  four
London      0    0      0     0
Paris       0    5      6     7
Berlin      8    9     10    11
Istanbul   12   13     14    15

In [240]:
data[data<5]

          one  two  three  four
London    0.0  0.0    0.0   0.0
Paris     0.0  NaN    NaN   NaN
Berlin    NaN  NaN    NaN   NaN
Istanbul  NaN  NaN    NaN   NaN

In [241]:
s=pd.Series([1,2,3,4],
            index=["a","b","c","d"])
s

a    1
b    2
c    3
d    4
dtype: int64

In [247]:
s1= s.reindex(['b','c','d','a','e'])
s1

b    2.0
c    3.0
d    4.0
a    1.0
e    NaN
dtype: float64